[
  {
    "title": "Cloud-Native Multimodal RAG System",
    "slug": "multimodal-rag-system",
    "description": "Building a multimodal Retrieval-Augmented Generation system combining textual and visual data for context-aware food recommendations.",
    "fullDescription": "Currently building a multimodal Retrieval-Augmented Generation (RAG) system that combines textual and visual data to generate context-aware food recommendations. This project leverages AWS Bedrock, S3, and FAISS for cloud-native data storage, vectorization, and scalable similarity search. The system features a Streamlit-based chatbot that enables cross-modal search through Claude-Sonnet Multimodal LLM, allowing users to query with both text and images.",
    "techStack": ["AWS Bedrock", "FAISS", "Streamlit", "Python", "AWS S3", "Claude-Sonnet LLM"],
    "tags": ["Machine Learning", "Cloud Computing", "Data Engineering","AWS"],
    "year": "2025",
    "image": "images/architecture copy.png",
    "images": [],
    "githubUrl": "",
    "liveUrl": "",
    "challenges": "Integrating multimodal data sources and ensuring accurate cross-modal retrieval while maintaining low latency for real-time recommendations.",
    "learnings": "Gained hands-on experience with AWS cloud services, vector databases, and the practical implementation of RAG architectures for production use cases."
  },
  {
    "title": "Real-Time Big Data Pipeline on AWS",
    "slug": "aws-big-data-pipeline",
    "description": "Real-time data pipeline on AWS processing COVID-19 API data every 5 minutes with interactive dashboards.",
    "fullDescription": "Designed and deployed a real-time data pipeline on AWS to process COVID-19 API data every 5 minutes, leveraging Apache NiFi for ingestion and encryption, and Kafka for distributed message streaming. Implemented PySpark jobs to transform and clean streaming data, writing outputs to HDFS and exposing curated data through Hive external tables for analytics. Automated pipeline scheduling using Apache Airflow, ensuring fault-tolerant execution across AWS EC2 nodes. Delivered interactive KPI dashboards in Tableau and AWS QuickSight, visualizing confirmed, recovered, and fatal case trends by region.",
    "techStack": ["Apache NiFi", "Kafka", "PySpark", "Hive", "Apache Airflow", "Tableau", "AWS QuickSight", "AWS EC2", "HDFS"],
    "tags": ["Data Engineering", "Cloud Computing", "Data Visualization","AWS"],
    "year": "2025",
    "image": "images/AWSHive.png",
    "images": [],
    "githubUrl": "",
    "liveUrl": "",
    "challenges": "Ensuring fault-tolerant execution and maintaining data consistency across distributed systems while processing real-time streaming data at scale.",
    "learnings": "Developed deep expertise in building end-to-end big data pipelines, orchestrating distributed workflows, and creating actionable insights through data visualization."
  },
  {
    "title": "Large-Scale Data Processing Pipeline",
    "slug": "azure-data-pipeline",
    "description": "End-to-end cloud pipeline using Medallion architecture to process 1M+ rows of European water sensor data.",
    "fullDescription": "Built an end-to-end cloud-based data pipeline using the Medallion architecture (Bronze, Silver, Gold layers) in Databricks to process 1M+ rows of European water sensor data, performing scalable transformations, cleansing, and outlier detection with SQL/Scala and Spark. Automated ingestion with Azure Logic Apps and designed interactive PowerBI dashboards using DAX measures to monitor KPIs and visualize water quality trends and anomalies.",
    "techStack": ["Azure SQL", "Databricks", "Power BI", "Spark", "SQL", "Scala", "Azure Logic Apps", "DAX"],
    "tags": ["Data Engineering", "Cloud Computing", "Data Analytics","Azure"],
    "year": "2025",
    "image": "images/AzureMedallion.png",
    "images": [],
    "githubUrl": "",
    "liveUrl": "",
    "challenges": "Processing and cleansing 1M+ rows of sensor data with varying quality levels while implementing effective outlier detection algorithms.",
    "learnings": "Mastered the Medallion architecture pattern for data lakes and gained proficiency in Azure cloud services and advanced Power BI dashboard development."
  },
  {
    "title": "Shelf of Health: Food Processing Visualization",
    "slug": "shelf-of-health",
    "description": "Visualization mapping grocery store shelves by food processing levels, revealing that even 'healthy' stores mainly stock ultra-processed foods.",
    "fullDescription": "Awarded Best Project Award, ranking in the top 3% of 180 students, for a creative and tangible visual design praised for its clarity and evocative storytelling. Developed an Excel-based visualization mapping grocery store shelves by food processing levels (NOVA classes), allowing users to intuitively see how 'healthy' stores still stock mostly ultra-processed foods. This project combined data analysis with creative visualization to tell a compelling story about food quality in modern grocery stores.",
    "techStack": ["Excel", "Python", "Data Visualization", "Statistical Analysis"],
    "tags": ["Data Visualization", "Data Analytics"],
    "year": "2025",
    "image": "images/Project 1_visual_withoutpercent.png",
    "images": [],
    "githubUrl": "",
    "liveUrl": "",
    "challenges": "Creating an intuitive and engaging visualization that effectively communicates complex nutritional data to a general audience.",
    "learnings": "Learned the importance of visual storytelling in data science and how creative presentation can make data insights more accessible and impactful."
  },
  {
    "title": "Exoplanet",
    "slug": "exoplanet-visualization",
    "description": "Visualizes exoplanet data using interactive maps.",
    "fullDescription": "todo",
    "techStack": ["JavaScript", "D3.js", "Data Visualization"],
    "tags": ["Data Visualization", "Web Development"],
    "year": "2025",
    "image": "images/Exoplanet-TOI.png",
    "images": [],
    "githubUrl": "https://github.com/Ctt011/World_OfExoplanets",
    "liveUrl": "https://ctt011.github.io/World_OfExoplanets/main/",
    "challenges": "todo",
    "learnings": "todo."
  },
  {
    "title": "Mouse",
    "slug": "Mousevis",
    "description": "todo",
    "fullDescription": "todo",
    "techStack": ["IoT", "Sensors", "Python", "Data Analysis"],
    "tags": ["IoT", "Data Analytics"],
    "year": "2025",
    "image": "images/MouseEstrous.png",
    "images": [],
    "githubUrl": "",
    "liveUrl": "",
    "challenges": "todo",
    "learnings": "todo."
  },
  {
    "title": "Culinary Trends Analysis",
    "slug": "culinary-trends-analysis",
    "description": "Uses machine learning and statistical testing on 84K Food.com recipes to explore how cuisine type affects ratings.",
    "fullDescription": "Used machine learning and statistical testing on 84,000 Food.com recipes to explore how cuisine type affects ratings. Built predictive models with feature engineering and SMOTE to improve accuracy and handle class imbalance. The project involved extensive data cleaning, exploratory data analysis, and the development of multiple classification models to predict recipe ratings based on various features including cuisine type, ingredients, and nutritional information.",
    "techStack": ["Python", "Machine Learning", "Pandas", "Scikit-learn", "SMOTE", "Statistical Testing"],
    "tags": ["Machine Learning", "Data Analytics"],
    "year": "2024",
    "image": "images/DistributionOf_ratings.png",
    "images": [],
    "githubUrl": "https://github.com/Ctt011/CuisineCritique",
    "liveUrl": "https://ctt011.github.io/CuisineCritique/",
    "challenges": "Handling class imbalance in the dataset and extracting meaningful features from unstructured recipe data.",
    "learnings": "Gained experience in feature engineering, dealing with imbalanced datasets using SMOTE, and applying statistical methods to validate machine learning findings."
  }
]
